/*Задача 56: Задайте прямоугольный двумерный массив. Напишите программу, которая будет 
находить строку с наименьшей суммой элементов.
Например, задан массив:
1 4 7 2
5 9 2 3
8 4 2 4
5 2 6 7

Программа считает сумму элементов в каждой строке и выдаёт номер строки с наименьшей суммой 
элементов: 1 строка
*/

 int[,] myArray = {
                { 1, 4, 7, 2 },
                { 5, 9, 9, 3 },
                { 1, 0, 2, 4 },
                { 5, 2, 6, 7}
            };

            int sum = 0;
            int minSum = 0;
            int numStr = 0;

            for (int i = 0; i < myArray.GetLength(0); i++)
            {
                for (int j = 0; j < myArray.GetLength(1); j++)
                {
                    sum += myArray[i, j];
                }

                if (i == 0)
                {
                    minSum = sum;
                }

                if (minSum > sum)
                {
                    minSum = sum;
                    numStr = i;
                }
                sum = 0;
            }

            Console.WriteLine($"Номер строки с наименьшей суммой элементов: {numStr + 1}");
        
    
